#+DRAWERS: HIDDEN

* DONE Setup
  CLOSED: [2014-12-24 Wed 13:45]
  :LOGBOOK:  
  - State "DONE"       from ""           [2014-12-24 Wed 13:45]
  :END:      
  - create a data directory
  - create a file and put in it the download links
#+begin_src sh :results verbatim raw replace   
  projdir="$HOME/projects/2014-12-20_datascibowl/"
  if [ -d "$projdir" ]
  then
    echo "$projdir exists, entering it"
    cd "$projdir"
  else
    echo "making $projdir and entering it"
    mkdir "$projdir" && cd "$_"
  fi
  if [-d "data"]
  then
    echo "data dir exists, entering it"
    cd "data"
  else
    echo "creating data directory and download file list"  
    mkdir "data" && cd "data"
    data_download.txt
    echo 'http://www.kaggle.com/c/datasciencebowl/download/train.zip' > data_download.txt
    echo 'http://www.kaggle.com/c/datasciencebowl/download/test.zip' >> data_download.txt
  fi
#+end_src
#+RESULTS:
/home/joth/projects/2014-12-20_datascibowl/ exists, entering it
creating data directory and download file list


** DONE setting up venv for distribution
   CLOSED: [2015-01-06 Tue 22:44]
   :LOGBOOK:  
   - State "DONE"       from "NEXT"       [2015-01-06 Tue 22:44]
   - State "NEXT"       from ""           [2015-01-06 Tue 22:43]
   :END:      
   - make requirements list

#+begin_src sh :noeval
pip freeze > ~/venvs/2014-12-20_datascibowl/requirements.txt
#+end_src

#+begin_src sh
cat $WORKON_HOME/2014-12-20_datascibowl/requirements.txt
#+end_src

#+RESULTS:
| Jinja2==2.7.3                         |
| MarkupSafe==0.23                      |
| Pillow==2.7.0                         |
| backports.ssl-match-hostname==3.4.0.2 |
| certifi==14.05.14                     |
| ipython==2.3.1                        |
| matplotlib==1.4.2                     |
| mock==1.0.1                           |
| nose==1.3.4                           |
| numpy==1.9.1                          |
| pandas==0.15.2                        |
| pyparsing==2.0.3                      |
| python-dateutil==2.4.0                |
| pytz==2014.10                         |
| pyzmq==14.4.1                         |
| scikit-image==0.10.1                  |
| scikit-learn==0.15.2                  |
| scipy==0.14.1                         |
| six==1.9.0                            |
| tornado==4.0.2                        |
| wsgiref==0.1.2                        |

   - pip install -r 
   - ipython
   - pyzmq
   - jinja2
   - tornado

** feature vs model selection
I tried a few features, with unexpected (poor) and otherwise
insignificant impact on the model performance

Lets consider something, about toying with features. 

#+begin_src python :results output
# https://docs.python.org/2/library/itertools.html#itertools.combinations
import itertools as iter

def count_iterable(i):
    return sum(1 for e in i)

num_vars = [x for x in range(10)]
num_combinations = {}

for vars in num_vars:
    var_list = [var for var in range(vars)]
    num_combinations[vars] = 0
    for subsets in [y for y in var_list]:
        combinations = iter.combinations(var_list, subsets)
        num_combinations[vars] += count_iterable(combinations)

print num_combinations
#+end_src

#+RESULTS:
: {0: 0, 1: 1, 2: 3, 3: 7, 4: 15, 5: 31, 6: 63, 7: 127, 8: 255, 9: 511}

There we have it, even 4 or 5 features, playing with them
manually becomes unruly.

With regression, we have some feature selection estimators,
i.e. lasso.

What about classification... decision trees should only use
the optimal split. But they'll use some split even if
there's not a good one.

So, is it more effective to begin already with the model
search? Or do we have to search the feature model space?

This already highlights the difficulty with lacking domain
knowledge. For the driver telematics I have a much better
chance and specifying a pretty full feature space, but for
plankton ID and image processing, where I know so little...
sheesh.

So, From here, given my efforts in toying with features have
been unsuccessful, my focus goes towards trying different
models and their parameter space. Then perhaps some progress
can be made here.
** DONE Shuffle the observations - keep it going forward
   CLOSED: [2015-02-16 Mon 10:36]
   :LOGBOOK:  
   - State "DONE"       from "NEXT"       [2015-02-16 Mon 10:36]
   CLOCK: [2015-02-16 Mon 10:08]--[2015-02-16 Mon 10:36] =>  0:28
   - State "NEXT"       from ""           [2015-02-15 Sun 22:10]
   :END:      
   - deterministically
   - this step alone improves misclassification rate from ~1 to ~0.8
** DONE Try SGD
   CLOSED: [2015-02-16 Mon 17:07]
   :LOGBOOK:  
   - State "DONE"       from "NEXT"       [2015-02-16 Mon 17:07]
   CLOCK: [2015-02-16 Mon 16:33]--[2015-02-16 Mon 17:07] =>  0:34
   - State "NEXT"       from ""           [2015-02-16 Mon 16:30]
   :END:      
   Module for performing batch gradient methods.
   Technically, SGD and BGD both work with any batch size,
   but SGD has no line search functionality and is thus best
   suited to small batches, while BGD supports line searches
   and thuse works best with large batches.

   [[http://deeplearning.net/software/pylearn2/library/train.html#module-pylearn2.training_algorithms.sgd][link]]
   [[deeplearning.net/software/pylearn2/library/train.html#module-pylearn2.training_algorithms.sgd][proper link]]

   How does this compare to BGD.
   :HIDDEN:
   class pylearn2.training_algorithms.bgd.BGD(
       cost=None, 
       batch_size=None, 
       batches_per_iter=None, 
       updates_per_batch=10, 
       monitoring_batch_size=None, 
       monitoring_batches=None, 
       monitoring_dataset=None, 
       termination_criterion=None, 
       set_batch_size=False, 
       reset_alpha=True, 
       conjugate=False, 
       min_init_alpha=0.001, 
       reset_conjugate=True, 
       line_search_mode=None, 
       verbose_optimization=False, 
       scale_step=1.0, 
       theano_function_mode=None, 
       init_alpha=None, 
       seed=None)
   class pylearn2.training_algorithms.sgd.SGD(
       learning_rate, 
       cost=None, 
       batch_size=None, 
       monitoring_batch_size=None, 
       monitoring_batches=None, 
       monitoring_dataset=None, 
       monitor_iteration_mode='sequential', 
       termination_criterion=None, 
       update_callbacks=None, 
       learning_rule=None, 
       set_batch_size=False, 
       train_iteration_mode=None, 
       batches_per_iter=None, 
       theano_function_mode=None, 
       monitoring_costs=None, 
       seed=[2012, 10, 5])
   :END:
   Basically, in terms of parameters, we now have to choose
   a learning rate.

   Bottou suggest expirimenting with different rates on
   small samples. This is a research topic on its own.

   I tried learning rates of 0.01 and 0.001 with 128 batch size.

   This is muuuuuch faster than BGD.

   But got better results with BGD (i.e. misclass rate of
   0.8x with SGD).

** DONE Implement the classifier cost function in monitoring [3/3]
   CLOSED: [2015-02-21 Sat 22:48]
   :LOGBOOK:  
   - State "DONE"       from "NEXT"       [2015-02-21 Sat 22:48]
   CLOCK: [2015-02-19 Thu 20:40]--[2015-02-19 Thu 20:40] =>  0:00
   :END:      
Summary: Theano is cool. Read carefully. I will use the
builtin NLL since mine may be comparitively slow. So forget
the multiclass log loss branch.

From ian goodfellow on google groups, there are a few options:

-Write a TrainExtension that adds one by calling Monitor.add_channel
-Subclass Model and override get_monitoring_channels
-Subclass Cost and override get_monitoring_channels

If you're interested in modifying the library itself, it
could be a good idea to make ModelExtensions support adding
monitoring channels to the model's default
get_monitoring_channels return value.

So, at /pylearn2/train_extensions there is an example of a
channel added, roc_auc, which I will use as reference.

*** DONE Research monitoring channel implementation
    CLOSED: [2015-02-19 Thu 22:22]
    :LOGBOOK:  
    - State "DONE"       from "NEXT"       [2015-02-19 Thu 22:22]
    CLOCK: [2015-02-19 Thu 20:40]--[2015-02-19 Thu 22:22] =>  1:42
    - State "NEXT"       from ""           [2015-02-19 Thu 20:10]
    :END:      
    - cool find, C-c C-x C-j goes to currently clocked in task
      
Here let's take a look at the multiclass log loss function.

#+NAME: multiclass_log_loss
#+begin_src python :noeval
def multiclass_log_loss(y_true, y_pred, eps=1e-15):
    predictions = np.clip(y_pred, eps, 1 - eps)

    # normalize row sums to 1
    predictions /= predictions.sum(axis=1)[:, np.newaxis]

    actual = np.zeros(y_pred.shape)
    n_samples = actual.shape[0]
    actual[np.arange(n_samples), y_true.astype(int)] = 1
    vectsum = np.sum(actual * np.log(predictions))
    loss = -1.0 / n_samples * vectsum
    return loss
#+end_src

That's straight forward enough. As for adding a monitoring
extension to pylearn, am referring to the roc_auc. It is
using y and y_hat. Exactly what are these and what format do
they take so I can appropriately feed them to the MLL?

I put a ~pdb.set_trace~ in the roc_auc monitor to find out.

#+begin_src python :noeval
y = T.argmax(target, axis=1)
y_hat = model.fprop(state)[:, self.positive_class_index]
#+end_src

#+begin_src python :noeval
(Pdb) p type(y)
<class 'theano.tensor.var.TensorVariable'>
(Pdb) p type(y_hat)
<class 'theano.tensor.var.TensorVariable'>
#+end_src

So these are simply symbols. 

Moving forward a few lines we come across

#+begin_src python :noeval
#...
    pos = T.eq(y, self.positive_class_index)
    neg = T.eq(y, self.negative_class_index)
    keep = T.add(pos, neg).nonzero()
    y = T.eq(y[keep], self.positive_class_index)
    y_hat = y_hat[keep]

roc_auc = RocAucScoreOp(self.channel_name_suffix)(y, y_hat)
roc_auc = T.cast(roc_auc, config.floatX)
#+end_src

Take note that for roc_auc, posotive and negative cases were
identified.

~RocAucScoreOp~ is a theano operation wrapper to sklearn's
roc_auc metric. In other words we need to get our metric to
work using theano's symbolic expressions.

That doesn't do any calculcations yet, just further sets up
the theano components. ~cast~ in the next line simply
changes its type to a flot.

Finally, the tensor is passed to ~monitor.add_channel~

#+begin_src python :noeval
model.monitor.add_channel(name=channel_name,
                          ipt=(state, target),
                          val=roc_auc,
                          data_specs=(m_space, m_source),
                          dataset=dataset)
#+end_src

with ~theano.pp~ we can nicely print the symbolic
expressions. I didn't import that so can't do it right now.

Continuing with pdb

Our ~roc_auc~ is now a float operation, but it's not being
used yet.

Late hours approach and this is where I would retire. So
I'll make a leap to ~monitor.add_channel~ and see what's
going on. After all, that's as far as I need to get.

#+begin_src python :noeval
add_channel(self, name, ipt, val, dataset=None, prereqs=None,
            data_specs=None):
"""
Asks the monitor to start tracking a new value.  Can be called
even after the monitor is already in use.

Parameters
----------
name : str
    The display name in the monitor.
ipt : tensor_like
    The symbolic tensor which should be clamped to the data.
    (or a list/tuple containing symbolic tensors, following the
    data_specs)
val : tensor_like
    The value (function of `ipt`) to be tracked.
dataset : pylearn2.datasets.Dataset
    Which dataset to compute this channel on
prereqs : list of callables that take a list of numpy tensors
    Each prereq must be called exactly once per each new batch
    of data drawn *from dataset* before the channel value is
    computed if two channels provide a prereq with exactly the
    same id, that prereq will only be called once
data_specs : (space, source) pair
    Identifies the order, format and semantics of ipt
"""

#+end_src

I only need to get the proper tensor expressions set up for
ipt and val. And from the looks of things, I only need to
adjust the theano wrapper of roc_auc to return an expression
for MLL.

It would be good to see another example. But I can't find.
Hold on now - here's the one for the misclassification rate.

#+begin_src python :noeval
if (targets is not None):
    if ((not self._has_binary_target) or
            self.binary_target_dim == 1):
        # if binary_target_dim>1, the misclass rate is ill-defined
        y_hat = T.argmax(state, axis=1)
        y = (targets.reshape(y_hat.shape)
             if self._has_binary_target
             else T.argmax(targets, axis=1))
        misclass = T.neq(y, y_hat).mean()
        misclass = T.cast(misclass, config.floatX)
        rval['misclass'] = misclass
    rval['nll'] = self.cost(Y_hat=state, Y=targets)
#+end_src

I think that exemplifies how straight forward this can be.
The proportion of nonmatching elements of the observed y and
predicted y_hat from the total number of observations is the
misclassifcation rate.

For me, y_hat must be probabilities, not classes. Om that
case it is easy, remove the argmax line, which decides
assigns a class based on the maximum probability.

In other words, replace the 

#+begin_src python :noeval
misclass = T.neq(y, y_hat).mean()
#+end_src

with a tensor expression for multiclass log loss.
[[multiclass_log_loss]]
*** DONE first check out multilayer perceptrons
    CLOSED: [2015-02-25 Wed 08:19]
    :LOGBOOK:  
    - State "DONE"       from "TODO"       [2015-02-25 Wed 08:19]
    :END:      
     - http://localhost:8888/notebooks/pylearn2_fork/pylearn2/scripts/tutorials/multilayer_perceptron/multilayer_perceptron.ipynb
     - The MLP makes a weak assumption on the model, that,
       generally speaking, the inputs map to outputs via the
       composition of several functions.

       A related issue with MLPs is that they have many
       configuration options. The model itself imposes
       design decisions such as what type of function to use
       for each layer, the dimensionality of each layer.
       Also, the log likelihood is no longer generally
       concave, so the choice of optimization procedure
       matters more than it did with softmax regression.
       These configuration options are known as
       "hyperparameters." Choosing the right hyperparameters
       is an open and exciting research problem

       To show how the MLP is specified via the yaml

       Model: !obj:pylearn2.models.mlp.MLP {
           layers: [
                 !obj:pylearn2.models.mlp.Sigmoid {
                     layer_name: 'h0',
                     dim: 500,
                     sparse_init: 15,
                 }, !obj:pylearn2.models.mlp.Softmax {
                     layer_name: 'y',
                     n_classes: 10,
                     irange: 0.
                 }
                ],
           nvis: 784,
       },

     see
     
#+begin_src sh
ls ipynb_work/*mlp*
#+end_src

#+RESULTS:
: ipynb_work/mlp_01.yaml

